org/roam/browsers.org
:PROPERTIES:
:ID:       536c7bc0-8049-429d-bfe6-641eeb67399c
:END:
#+title: browsers
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container content
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* browsers
This your brain on the internet
** notes
- ctrl-shift-R for force cache reload
- ctrl-w for close tab
- ctrl-t for new tab
- ctrl-tab for switch tab
- threads provided via web workers
  - [[https://github.com/BuilderIO/partytown][web worker background loading]]
- offline webapp manifest support with service worker
- ARIA elements for accessibility
- third-party iframe service workers can only register themselves if third party cookies are enabled ~chrome://settings/cookies~
- URL hash fragments can store information that the browser should not send to backend (customization)
*** pwa
- managed under ~brave://apps/~ or ~chrome://apps~
- progressive web apps have a manifest and service worker for offline installable apps
  - must have name, icons, start-url and display
  - can be published as a TWA (trusted web app) android application with [[https://github.com/GoogleChromeLabs/bubblewrap][bubblewrap]]
  - service workers should not cache the manifest, itself or icons (16x16 and 32x32 should be cached for browser favicons)
  - service workers require https or ~chrome://flags/#unsafely-treat-insecure-origin-as-secure~ to be set locally
- add the manifest to the html ~<head>~ as ~<link rel="manifest" href="./manifest.json">~
- Isolated Web Apps for signed updates
#+NAME: manifest.json
#+BEGIN_SRC javascript :tangle no
{
    "name": "Progressive Web App",
    "short_name": "PWA",
    "icons": [{
      "src": "./icon-256.png",
        "sizes": "256x256",
        "type": "image/png"
      }],
    "lang": "en-US",
    "start_url": "./index.html",
    "display": "standalone",
    "background_color": "white",
    "theme_color": "white"
}
#+END_SRC
#+NAME: index.html-swjs
#+BEGIN_SRC html :tangle no
<script>
    // register ServiceWorker
    window.onload = () => {
        'use strict';
        if ('serviceWorker' in navigator) {
            navigator.serviceWorker
                    .register('./service_worker.js');
        }
    }
</script>
#+END_SRC
#+NAME: service-worker.js
#+BEGIN_SRC javascript :tangle no
var cacheName = 'pwa';
var filesToCache = [
  './',
  './index.html',
  './build/bundle.js',
  './build/bundle.wasm'
];
/* Start the service worker and cache all of the app's content */
self.addEventListener('install', function(e) {
  e.waitUntil(
    caches.open(cacheName).then(function(cache) {
      return cache.addAll(filesToCache);
    })
  );
});
/* Serve cached content when offline */
self.addEventListener('fetch', function(e) {
  e.respondWith(
    caches.match(e.request).then(function(response) {
      return response || fetch(e.request);
    })
  );
});
#+END_SRC
** [[id:aae21430-637a-4b92-8f8a-d35e9991e396][firefox]]
** chrome
- ~chrome://tracing~ for browser tracing
  - https://chrome.google.com/webstore/detail/perfetto-ui/lfmkphfpdbjijhpomgecfikhfohaoine is the ui.perfetto.dev extension for tracing
- dev tools wasm dwarf debug extension https://chrome.google.com/webstore/detail/cc%20%20-devtools-support-dwa/pdcpmagijalfljmkmjngeonclgbbannb
- enable wayland scaling with ~--enable-features=UseOzonePlatform --ozone-platform=wayland~ cli args
- set size at launch ~window-size=1920,1080~
- ~--ignore-certificate-errors~ cli arg to enable expired certs
- pozzed by google
  - changed to suit their needs
    - deprecate app manifest v2 (brave preserves)
    - allow any website to write to clipboard [[https://chromium.googlesource.com/chromium/src/+/4d7b74b051abfe5945f418601fdc2ffc8ce3072c][to make doodle work]] without required gesture
      - brave [[https://github.com/brave/brave-browser/issues/16890][thought about]] blocking
- blink and V8 for engine
- fork of chromium
- forks
  - brave
    - ~brave://gpu~
    - ~brave://flags~
      - WebGPU flag ~--enable-features=Vulkan~
    - builtin tor, ad block
    - disable wallet, sidebar
    - F12 Dev Tools -> Ctrl+Shift+P -> type 'shot' for screen capture options
    - ~brave://flags/#ozone-platform-hint~ set to auto for wayland default instead of x11
    - Alt w to close tab, ctrl tab to cycle, 
  - ungoogled-chromium
  - microsoft edge
  - [[https://github.com/fathyb/carbonyl][terminal browser]]
  - [[https://cobalt.googlesource.com/cobalt][cobalt embeded app]]
** safari
- webkit based
* search engines
** [[id:b4a6be9e-1cb6-416a-b6e0-392ee9a28734][searx]]
** ddg
- fingerprinted users multiple times
- no js version at lite.duckduckgo.com
- uses bing (Micro$haft), yahoo
  - [[https://twitter.com/shivan_kaul/status/1528879590772338689][allow microsoft tracking]] [[https://twitter.com/thezedwards/status/1528808790845362176][in product]]
  - filters more than bing
    - russians 'propaganda' sites (RT/sputnik) blocked/deranked
    - torrent sites not blocked on bing blocked on ddg
** brave
- tonemapping support for hdr pngs
- search.brave.com
- has 'Goggles' for custom ranking
- support bangs like !g
- https://search.brave.com/search?q=%s to add to browser
* sites
** tools
- [[https://wasm-test.libreoffice.org/][libreoffice wasm]]
- https://directfile.irs.gov/
** data
- https://ossinsight.io/#trending-repos
- https://sourcegraph.com/search
- https://search.marginalia.nu/
- https://stract.com/
- https://mwmbl.org
- Shodan
- Zoomeye
- censys
- http://ghostarchive.org/
- xrel.to
- srrdb
- https://btdig.com/
** alternative frontends
- youtube
  - [[https://piped.video/trending][piped.video]]
  - https://yewtu.be/
  - https://incogtube.com
- https://incogsnoo.com/ (reddit)
** media
- https://ustv247.tv/
- https://scnlog.me/
- https://nr4.d-snf.net/
- https://z-lib.org/
- https://libgen.is/
- https://hianime.to
- https://zoroxtv.to/
- https://upmovies.net/
- https://cs.rin.ru
- https://cdm-project.com/Download-Tools/StreamFab
- sanet.st
- https://annas-archive.org/
- https://search.rlsbb.cc/
- https://nibl.co.uk/bots (Rizon)
- https://animk.info/xdcc (Xertion)
- https://subsplease.org/ (Rizon)
- audioz.download
- https://www.binsearch.info/
