docs/browsers.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>browsers</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="orgb0058af">
<div class="navbar-brand" id="org601dadf">
<div class="navbar-item" id="org0e4458f">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="orgb94bf15">
<div class="navbar-start" id="org7d9c894">
<div class="navbar-item" id="org356b74c">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org15720ee">

</div>

</div>
</nav>
<div id="outline-container-orgf51f814" class="outline-2">
<h2 id="orgf51f814">browsers</h2>
<div class="outline-text-2" id="text-orgf51f814">
<p>
This your brain on the internet
</p>
</div>
<div id="outline-container-orgda108e8" class="outline-3">
<h3 id="orgda108e8">notes</h3>
<div class="outline-text-3" id="text-orgda108e8">
<ul class="org-ul">
<li>ctrl-shift-R for force cache reload</li>
<li>ctrl-w for close tab</li>
<li>ctrl-t for new tab</li>
<li>ctrl-tab for switch tab</li>
<li>threads provided via web workers
<ul class="org-ul">
<li><a href="https://github.com/BuilderIO/partytown">web worker background loading</a></li>
</ul></li>
<li>offline webapp manifest support with service worker</li>
<li>ARIA elements for accessibility</li>
<li>third-party iframe service workers can only register themselves if third party cookies are enabled <code>chrome://settings/cookies</code></li>
<li>URL hash fragments can store information that the browser should not send to backend (customization)</li>
</ul>
</div>
<div id="outline-container-org2bf0585" class="outline-4">
<h4 id="org2bf0585">pwa</h4>
<div class="outline-text-4" id="text-org2bf0585">
<ul class="org-ul">
<li>managed under <code>brave://apps/</code> or <code>chrome://apps</code></li>
<li>progressive web apps have a manifest and service worker for offline installable apps
<ul class="org-ul">
<li>must have name, icons, start-url and display</li>
<li>can be published as a TWA (trusted web app) android application with <a href="https://github.com/GoogleChromeLabs/bubblewrap">bubblewrap</a></li>
<li>service workers should not cache the manifest, itself or icons (16x16 and 32x32 should be cached for browser favicons)</li>
<li>service workers require https or <code>chrome://flags/#unsafely-treat-insecure-origin-as-secure</code> to be set locally</li>
</ul></li>
<li>add the manifest to the html <code>&lt;head&gt;</code> as <code>&lt;link rel="manifest" href="./manifest.json"&gt;</code></li>
<li>Isolated Web Apps for signed updates</li>
</ul>
<div class="org-src-container">
<pre class="src src-javascript" id="org0e7c2f1">{
    "name": "Progressive Web App",
    "short_name": "PWA",
    "icons": [{
      "src": "./icon-256.png",
        "sizes": "256x256",
        "type": "image/png"
      }],
    "lang": "en-US",
    "start_url": "./index.html",
    "display": "standalone",
    "background_color": "white",
    "theme_color": "white"
}
</pre>
</div>
<div class="org-src-container">
<pre class="src src-html" id="org2b65fb5">&lt;script&gt;
    // register ServiceWorker
    window.onload = () =&gt; {
        'use strict';
        if ('serviceWorker' in navigator) {
            navigator.serviceWorker
                    .register('./service_worker.js');
        }
    }
&lt;/script&gt;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-javascript" id="orged27d21">var cacheName = 'pwa';
var filesToCache = [
  './',
  './index.html',
  './build/bundle.js',
  './build/bundle.wasm'
];
/* Start the service worker and cache all of the app's content */
self.addEventListener('install', function(e) {
  e.waitUntil(
    caches.open(cacheName).then(function(cache) {
      return cache.addAll(filesToCache);
    })
  );
});
/* Serve cached content when offline */
self.addEventListener('fetch', function(e) {
  e.respondWith(
    caches.match(e.request).then(function(response) {
      return response || fetch(e.request);
    })
  );
});
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfb7e22f" class="outline-3">
<h3 id="orgfb7e22f"><a href="firefox.html#ID-aae21430-637a-4b92-8f8a-d35e9991e396">firefox</a></h3>
</div>
<div id="outline-container-orge725c9c" class="outline-3">
<h3 id="orge725c9c">chrome</h3>
<div class="outline-text-3" id="text-orge725c9c">
<ul class="org-ul">
<li><code>chrome://tracing</code> for browser tracing
<ul class="org-ul">
<li><a href="https://chrome.google.com/webstore/detail/perfetto-ui/lfmkphfpdbjijhpomgecfikhfohaoine">https://chrome.google.com/webstore/detail/perfetto-ui/lfmkphfpdbjijhpomgecfikhfohaoine</a> is the ui.perfetto.dev extension for tracing</li>
</ul></li>
<li>dev tools wasm dwarf debug extension <a href="https://chrome.google.com/webstore/detail/cc%20%20-devtools-support-dwa/pdcpmagijalfljmkmjngeonclgbbannb">https://chrome.google.com/webstore/detail/cc%20%20-devtools-support-dwa/pdcpmagijalfljmkmjngeonclgbbannb</a></li>
<li>enable wayland scaling with <code>--enable-features=UseOzonePlatform --ozone-platform=wayland</code> cli args</li>
<li>set size at launch <code>window-size=1920,1080</code></li>
<li><code>--ignore-certificate-errors</code> cli arg to enable expired certs</li>
<li>pozzed by google
<ul class="org-ul">
<li>changed to suit their needs
<ul class="org-ul">
<li>deprecate app manifest v2 (brave preserves)</li>
<li>allow any website to write to clipboard <a href="https://chromium.googlesource.com/chromium/src/+/4d7b74b051abfe5945f418601fdc2ffc8ce3072c">to make doodle work</a> without required gesture
<ul class="org-ul">
<li>brave <a href="https://github.com/brave/brave-browser/issues/16890">thought about</a> blocking</li>
</ul></li>
</ul></li>
</ul></li>
<li>blink and V8 for engine</li>
<li>fork of chromium</li>
<li>forks
<ul class="org-ul">
<li>brave
<ul class="org-ul">
<li><code>brave://gpu</code></li>
<li><code>brave://flags</code>
<ul class="org-ul">
<li>WebGPU flag <code>--enable-features=Vulkan</code></li>
</ul></li>
<li>builtin tor, ad block</li>
<li>disable wallet, sidebar</li>
<li>F12 Dev Tools -&gt; Ctrl+Shift+P -&gt; type 'shot' for screen capture options</li>
</ul></li>
<li>ungoogled-chromium</li>
<li>microsoft edge</li>
<li><a href="https://github.com/fathyb/carbonyl">terminal browser</a></li>
<li><a href="https://cobalt.googlesource.com/cobalt">cobalt embeded app</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8c75f79" class="outline-3">
<h3 id="org8c75f79">safari</h3>
<div class="outline-text-3" id="text-org8c75f79">
<ul class="org-ul">
<li>webkit based</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcd03032" class="outline-2">
<h2 id="orgcd03032">search engines</h2>
<div class="outline-text-2" id="text-orgcd03032">
</div>
<div id="outline-container-org5e0d7eb" class="outline-3">
<h3 id="org5e0d7eb"><a href="searx.html#ID-b4a6be9e-1cb6-416a-b6e0-392ee9a28734">searx</a></h3>
</div>
<div id="outline-container-orgdc2f801" class="outline-3">
<h3 id="orgdc2f801">ddg</h3>
<div class="outline-text-3" id="text-orgdc2f801">
<ul class="org-ul">
<li>fingerprinted users multiple times</li>
<li>no js version at lite.duckduckgo.com</li>
<li>uses bing (Micro$haft), yahoo
<ul class="org-ul">
<li><a href="https://twitter.com/shivan_kaul/status/1528879590772338689">allow microsoft tracking</a> <a href="https://twitter.com/thezedwards/status/1528808790845362176">in product</a></li>
<li>filters more than bing
<ul class="org-ul">
<li>russians 'propaganda' sites (RT/sputnik) blocked/deranked</li>
<li>torrent sites not blocked on bing blocked on ddg</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgdf855f4" class="outline-3">
<h3 id="orgdf855f4">brave</h3>
<div class="outline-text-3" id="text-orgdf855f4">
<ul class="org-ul">
<li>search.brave.com</li>
<li>has 'Goggles' for custom ranking</li>
<li>support bangs like !g</li>
<li><a href="https://search.brave.com/search?q=%s">https://search.brave.com/search?q=%s</a> to add to browser</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb753d3e" class="outline-2">
<h2 id="orgb753d3e">sites</h2>
<div class="outline-text-2" id="text-orgb753d3e">
</div>
<div id="outline-container-org2f276f1" class="outline-3">
<h3 id="org2f276f1">tools</h3>
<div class="outline-text-3" id="text-org2f276f1">
<ul class="org-ul">
<li><a href="https://wasm-test.libreoffice.org/">libreoffice wasm</a></li>
<li><a href="https://directfile.irs.gov/">https://directfile.irs.gov/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7690ff0" class="outline-3">
<h3 id="org7690ff0">data</h3>
<div class="outline-text-3" id="text-org7690ff0">
<ul class="org-ul">
<li><a href="https://ossinsight.io/#trending-repos">https://ossinsight.io/#trending-repos</a></li>
<li><a href="https://sourcegraph.com/search">https://sourcegraph.com/search</a></li>
<li><a href="https://search.marginalia.nu/">https://search.marginalia.nu/</a></li>
<li><a href="https://stract.com/">https://stract.com/</a></li>
<li><a href="https://mwmbl.org">https://mwmbl.org</a></li>
<li>Shodan</li>
<li>Zoomeye</li>
<li>censys</li>
<li><a href="http://ghostarchive.org/">http://ghostarchive.org/</a></li>
<li>xrel.to</li>
<li>srrdb</li>
<li><a href="https://btdig.com/">https://btdig.com/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org823f4f5" class="outline-3">
<h3 id="org823f4f5">alternative frontends</h3>
<div class="outline-text-3" id="text-org823f4f5">
<ul class="org-ul">
<li>youtube
<ul class="org-ul">
<li><a href="https://piped.video/trending">piped.video</a></li>
<li><a href="https://yewtu.be/">https://yewtu.be/</a></li>
<li><a href="https://incogtube.com">https://incogtube.com</a></li>
</ul></li>
<li><a href="https://incogsnoo.com/">https://incogsnoo.com/</a> (reddit)</li>
</ul>
</div>
</div>
<div id="outline-container-org93b702c" class="outline-3">
<h3 id="org93b702c">media</h3>
<div class="outline-text-3" id="text-org93b702c">
<ul class="org-ul">
<li><a href="https://ustv247.tv/">https://ustv247.tv/</a></li>
<li><a href="https://scnlog.me/">https://scnlog.me/</a></li>
<li><a href="https://nr4.d-snf.net/">https://nr4.d-snf.net/</a></li>
<li><a href="https://z-lib.org/">https://z-lib.org/</a></li>
<li><a href="https://libgen.is/">https://libgen.is/</a></li>
<li><a href="https://hianime.to">https://hianime.to</a></li>
<li><a href="https://zoroxtv.to/">https://zoroxtv.to/</a></li>
<li><a href="https://upmovies.net/">https://upmovies.net/</a></li>
<li><a href="https://cs.rin.ru">https://cs.rin.ru</a></li>
<li><a href="https://cdm-project.com/Download-Tools/StreamFab">https://cdm-project.com/Download-Tools/StreamFab</a></li>
<li>sanet.st</li>
<li><a href="https://annas-archive.org/">https://annas-archive.org/</a></li>
<li><a href="https://search.rlsbb.cc/">https://search.rlsbb.cc/</a></li>
<li><a href="https://nibl.co.uk/bots">https://nibl.co.uk/bots</a> (Rizon)</li>
<li><a href="https://animk.info/xdcc">https://animk.info/xdcc</a> (Xertion)</li>
<li><a href="https://subsplease.org/">https://subsplease.org/</a> (Rizon)</li>
<li>audioz.download</li>
<li><a href="https://www.binsearch.info/">https://www.binsearch.info/</a></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
